driver-tests/bpelse/assign/AssignJbi/test/results/echoNonNegativeIntegerDataType_Invoke/Actual_20130319180454_S.xml

<?xml version="1.0" encoding="UTF-8" standalone="no"?>
<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/" 
    xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" 
    xsi:schemaLocation="http://schemas.xmlsoap.org/soap/envelope/ http://schemas.xmlsoap.org/soap/envelope/">
  <SOAP-ENV:Body>
    <item xmlns="http://stc.com/echoNonNegativeIntegerDataType" xmlns:msgns="http://stc.com/echoNonNegativeIntegerDataType">
      <string>200</string>
      <normalizedString>200</normalizedString>
      <token>200</token>
      <base64Binary>200</base64Binary>
      <hexBinary>200</hexBinary>
      <integer>200</integer>
      <positiveInteger>200</positiveInteger>
      <nonNegativeInteger>200</nonNegativeInteger>
      <nonPositiveInteger>200</nonPositiveInteger>
      <long>200</long>
      <unsignedLong>200</unsignedLong>
      <int>200</int>
      <unsignedInt>200</unsignedInt>
      <short>200</short>
      <unsignedShort>200</unsignedShort>
      <byte>200</byte>
      <unsignedByte>200</unsignedByte>
      <decimal>200</decimal>
      <float>200</float>
      <double>200</double>
      <boolean>200</boolean>
      <duration>200</duration>
      <dateTime>200</dateTime>
      <date>200</date>
      <time>200</time>
      <gYear>200</gYear>
      <gYearMonth>200</gYearMonth>
      <gMonth>200</gMonth>
      <gMonthDay>200</gMonthDay>
      <gDay>200</gDay>
      <Name>200</Name>
      <QName>200</QName>
      <NCName>200</NCName>
      <anyURI>200</anyURI>
      <language>200</language>
      <ID>200</ID>
      <IDREF>200</IDREF>
      <IDREFS>200</IDREFS>
      <ENTITY>200</ENTITY>
      <ENTITIES>200</ENTITIES>
      <NMTOKEN>200</NMTOKEN>
      <NMTOKENS>200</NMTOKENS>
    </item>
  </SOAP-ENV:Body>
</SOAP-ENV:Envelope>